__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
image_input (InputLayer)        (None, 512)          0                                            
__________________________________________________________________________________________________
image_model (Model)             (None, 64, 512)      846883      image_input[0][0]                
__________________________________________________________________________________________________
global_average_pooling1d_1 (Glo (None, 512)          0           image_model[1][0]                
__________________________________________________________________________________________________
prev_words (InputLayer)         (None, 17)           0                                            
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 300)          153900      global_average_pooling1d_1[0][0] 
__________________________________________________________________________________________________
embedding_1 (Embedding)         (None, 17, 300)      301200      prev_words[0][0]                 
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 300)          0           dense_11[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 17, 300)      0           embedding_1[0][0]                
__________________________________________________________________________________________________
repeat_vector_1 (RepeatVector)  (None, 17, 300)      0           dropout_4[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 17, 300)      0           activation_1[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 17, 600)      0           repeat_vector_1[0][0]            
                                                                 dropout_6[0][0]                  
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 17, 600)      0           concatenate_1[0][0]              
__________________________________________________________________________________________________
h_forward (LSTM)                (None, 17, 512)      2279424     dropout_7[0][0]                  
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 64, 300)      153900      image_model[1][0]                
__________________________________________________________________________________________________
zh_linear (Conv1D)              (None, 17, 300)      153900      h_forward[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 64, 300)      0           conv1d_4[0][0]                   
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 17, 300)      0           zh_linear[0][0]                  
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 64, 300)      90300       dropout_5[0][0]                  
__________________________________________________________________________________________________
zh_embed (Conv1D)               (None, 17, 300)      90300       dropout_8[0][0]                  
__________________________________________________________________________________________________
z_v_embed (TimeDistributed)     (None, 64, 17, 300)  0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, 17, 64, 300)  0           zh_embed[0][0]                   
__________________________________________________________________________________________________
permute_2 (Permute)             (None, 17, 64, 300)  0           z_v_embed[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 17, 64, 300)  0           time_distributed_1[0][0]         
                                                                 permute_2[0][0]                  
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 17, 64, 300)  0           add_4[0][0]                      
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, 17, 64, 300)  0           dropout_9[0][0]                  
__________________________________________________________________________________________________
att (TimeDistributed)           (None, 17, 64, 1)    301         time_distributed_2[0][0]         
__________________________________________________________________________________________________
att_res (Reshape)               (None, 17, 64)       0           att[0][0]                        
__________________________________________________________________________________________________
att_scores (TimeDistributed)    (None, 17, 64)       0           att_res[0][0]                    
__________________________________________________________________________________________________
att_rep (TimeDistributed)       (None, 17, 300, 64)  0           att_scores[0][0]                 
__________________________________________________________________________________________________
z_v_linear (TimeDistributed)    (None, 64, 17, 300)  0           dropout_5[0][0]                  
__________________________________________________________________________________________________
att_rep_p (Permute)             (None, 17, 64, 300)  0           att_rep[0][0]                    
__________________________________________________________________________________________________
permute_1 (Permute)             (None, 17, 64, 300)  0           z_v_linear[0][0]                 
__________________________________________________________________________________________________
multiply_5 (Multiply)           (None, 17, 64, 300)  0           att_rep_p[0][0]                  
                                                                 permute_1[0][0]                  
__________________________________________________________________________________________________
c_vec (TimeDistributed)         (None, 17, 300)      0           multiply_5[0][0]                 
__________________________________________________________________________________________________
add_5 (Add)                     (None, 17, 300)      0           dropout_8[0][0]                  
                                                                 c_vec[0][0]                      
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, 17, 300)      90300       add_5[0][0]                      
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 17, 300)      0           time_distributed_3[0][0]         
__________________________________________________________________________________________________
out (TimeDistributed)           (None, 17, 1004)     302204      dropout_10[0][0]                 
==================================================================================================
Total params: 4,462,612
Trainable params: 4,462,612
Non-trainable params: 0
__________________________________________________________________________________________________
Train on 400135 samples, validate on 195954 samples